Autodesk.Revit.DB.AddInId.SendAdpData(Autodesk.ADPDesktopSDK.Facets.Core)
Sends ADP Core facet with analytics data to the Revit
for processing and sending to the ADP data lake.
coreFacet:
Container for analytics data
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020